//
//  ContractText.swift
//  LIBRA
//
//  Created by 好用的电脑 on 2023/9/24.
//

import Foundation


let contractTextb = NSAttributedString(string: contractText2)
let contractTextc = NSAttributedString(string: contractText3)
let contractTextd = NSAttributedString(string: contractText4)
let contractTexte = NSAttributedString(string: contractText5)

let contractText2 = 
"""




然而如果船舶早于提名的 5DDR 第一天到达，卸货时间从 5DDR 第一天可用潮水开始时
才开始计时。如果卖方想早于 5DDR 靠泊并且买方可以安排早靠，那么从船舶所有缆绳
系好到 5DDR 第一天可用高潮节省的时间的 50%应该从卸货时间中扣除。如果船舶晚于
5DDR 的最后一天到达，并且买方以书面形式愿意接受晚靠泊，卸货时间从开始卸货计
时，否则，时间保留效力。
如果因为潮水原因船舶无法靠泊，等潮时间不应记为卸货时间。
卸货时间应该从船舶在每个卸货港锚地递交 NOR6 个小时后开始计算或者船舶所有缆
绳都系好，以较早者为准。
卸货时间应该从卸货管断开后结束。

12. 黑夜条款
如果因为港口当局/引航员/码头因为天黑后引航的限制，船舶在抵港后无法靠泊，等待
引航的时间到次日早上 8.00 或船舶所有缆绳系好，以较早者为准，不能计做卸货时间，
除非船舶已滞期。
即使船舶可以在夜间靠泊，但是码头不能在夜间办理检疫手续，那到次日 08.00 等待检
疫的时间不能计入已用卸货时间。

13. 极端天气
因为天气原因到时的卸货晚靠泊均应计一半的卸货时间，如果已经滞期，按一般的滞期
费率计算。

14. 移泊
从卸货港锚地到泊位的移泊时间应从卸货时间中扣除，即使船舶已经滞期。移泊时间从
起锚开始计算。

15. 滞期
滞期费率 20000 美元/天。

16. 测量和检查
产品的数量由一级独立检验机构在卸货港检验，费用由买方承担。产品的质量（不包括
密度）应根据标准做法在装货港确定。

17. 所有权和风险
一旦货物在卸货港通过船舶法兰，货权和风险从卖方转移到买方。

18. 不可抗力
任何一方都不能部分或全部不履行、晚履行合同义务，除非因上帝、政府的行为而产生
的付款义务 命令或限制（包括无法获得所需的许可、许可、同意或批准，以及由于政府
命令或限制而无法履行职责）、罢工、骚乱、禁运、革命、战争（宣布或未宣布、破坏、
火灾、 洪水或任何其他双方无法控制的原因或情况。
但是，遇到此类延误或失败的一方应立即通知另一方，并尽最大努力消除所有可能的发
货或延误的原因或情况。


"""

let contractText3 = 
"""




19. 反腐败条款
合同双方将各自遵守并适用有关反贿赂或反洗钱有关的法律、规则、法规、法令和/或
政府官方命令的方式并受英国、欧盟、美国、新加坡、中国或各方适用的其他司法管辖
区管辖。 如果一方有理由相信另一方违反了其在本条款下的任何义务，则非违约方可
以在不违约的情况下，在向另一方发出书面通知（有合理证据支持）的情况下终止本协
议。

20. 贸易管制
合同主体任何一方均无义务以任何方式要求另一方履行义务本协议要求的其他情况(包
括但不限于 (A) 向个人或实体执行、交付、接受、出售、购买、支付或接收款项的义
务，或 (B) 参与任何其他违法行为）或使该方遭受惩罚措施或国际抵制以及制裁
如果一方的任何行为违反、不符合或使该方遭受贸易限制下的惩罚措施，该方（“受影
响方”）应在合理可行的情况下尽快向另一方发出书面通知无法履行的一方。受影响方
应有权：
A. 立即暂停履行义务（无论是付款还是履行义务），直至受影响方可以合法地解除该
义务；和/或
B. 如果无法履行义务的情况持续到履行义务的合同时间结束或 30 天（以较早者为
准），则完全解除义务，前提是该义务与支付已经交付的货物，在受影响的一方可以合
法地恢复付款之前，该义务应保持暂停（不影响对未付款项的任何利息的应计）；和/
或
C. 如果义务是接受船舶、驳船或卡车、其他运输方式（视情况而定），或要求另一方
指定替代品（但替代品必须与运输方式相同）最初提名），
在每种情况下均不承担任何责任（包括但不限于因违反合同、处罚、成本、费用和开
支而造成的任何损害）。

21. 所有权保证
卖方再次担保在任何时间不仅限于交货时间有货品所有权包括转移货品转移所产生的
风险，并进一步拥有将所有权准让给买方的全部权利或授权。

22. ISPS 合规
i) 卖方应促使船舶遵守国际船舶和港口设施保安规则以及 SOLAS 第 XI 章（ISPS 规则）
相关修订的要求。
II) 船舶应在到达卸货港前按要求向有关当局提交安全声明（DOS）。
III) 尽管买方事先接受了船舶，但在此之前的任何时间；船舶抵达卸货港后，船舶不再遵
守 ISPS 规则或 MTSA 的要求：
A) 买方有权不将此类指定船舶停泊在卸货港，由此产生的任何滞期费不得由买方
承担。
B) 卖方有义务用符合 ISPS 规则要求的船舶更换此类指定船舶。如果船上货物的所
有权和风险随后根据 III) B) 替代的船舶已经转移给买方，则该所有权和风险应被视为已
归还给卖方。
"""

let contractText4 = 
"""




IV) A) 买方应确保卸货港/码头/设施符合国际船舶和港口设施保安规则以及
SOLAS 第 XI 章（ISPS 规则）相关修正案的要求。
B) 任何与船舶有关的成本或费用，包括在卸货港对船舶征收的滞期费或任何额外
费用、费用或关税，由卖方直接因卸货港/码头/安装未能遵守规定而实际产生 ISPS
应由买方承担，包括但不限于船舶在采取任何行动或任何特殊或附加安全措施时所需的
时间或发生的费用。
V) 买方根据本协议对卖方因卸货港/码头/安装未能遵守 ISPS 守则而导致的船舶、租加
或船东产生的任何成本、损失或费用的责任限于卖方根据本条款的规定支付滞期费和实
际发生的费用。

27. COVID-19 条款
在 COVID-19 或类型情况下，引航服务仅有码头或当局行政命令暂停或取消，由此造成
的等待时间应有买方负责。如果因为船员出现发烧或其他新冠症状造成无法发放检疫结果
等其他超出买方控制范围的情况，时间和费用应有卖方负责。

28 适用法律或仲裁
 本合同应受英国法律管辖并根据英国法律解释。任何因本合同或违反本合同而引起的或
与之相关的任何争议、纠纷或索赔，均应提交香港国际仲裁中心根据香港国际仲裁中心
管理的仲裁规则进行仲裁并最终解决任何现行的法定修改或重新制定。应有三名仲裁员。
申请人和被申请人应各选择一名仲裁员。第三名仲裁员由香港国际仲裁中心（HKIAC）
委任，并担任仲裁庭的首席仲裁员。
仲裁程序开始时的上述协会的现行条款应适用于本条款项下的所有程序。
仲裁程序的决定应为最终决定，对双方均具有约束力。

29. 税收
卖方应负责支付在装货地产生的任何税款、关税或其他费用
买方应负责在卸货地进口时产生的所有税款和其他费用。

30. 索赔
如果根据本合同或与本合同有关的任何索赔，索赔方应在最终卸货完成之日起 90 天
内以书面形式将其索赔通知另一方，并提供支持文件，否则将被禁止并视为放弃索赔。

31. 文件
出于报关需要，报关文件需要在船到前五个工作日或买方要求后一天通过邮件形式送出。
如果买方要求，卖方应帮助买方签发 FORM-E/FORM AU 或在原产国签发其他类似文
件。

32. 保密性条款
交易应严格保密

"""

let contractText5 =
"""






"""
